test/graphs/graph_test/single_node_with_customer_depth_10.dot
digraph unix {
    graph [nodesep = 0.25; ranksep=1];
    fontname="Helvetica,Arial,sans-serif"
    node [fontname="Helvetica,Arial,sans-serif"]
    edge [fontname="Helvetica,Arial,sans-serif"]
    subgraph cluster_level3_2 {
        label = "level3";
        subgraph cluster_level2_3 {
            label = "level2";
            subgraph cluster_level1_4 {
                label = "level1";
                subgraph cluster_level0_5 {
                    label = "level0";
                    style = filled;
                    fillcolor = "#DDDDDD";
                    x_7 [
                    label="x"
                    style = filled;
                    fillcolor = "#EEEEEE";
                    ];
                    
                }
                c0_8 [
                label="c0"
                ];
                c1_9 [
                label="c1"
                ];
                
            }
            c00_10 [
            label="c00"
            ];
            c01_11 [
            label="c01"
            ];
            c10_12 [
            label="c10"
            ];
            c11_13 [
            label="c11"
            ];
            
        }
        c111_14 [
        label="c111"
        ];
        
    }
    "c11_13" -> "c111_14";
    "c0_8" -> "c00_10";
    "c0_8" -> "c01_11";
    "c1_9" -> "c10_12";
    "c1_9" -> "c11_13";
    "x_7" -> "c0_8";
    "x_7" -> "c1_9";
}
